{"corpus": {"552466": {"text": "That is because they don't pay enough. Sure you can get good money in a union from a large urban center, but that is only a fraction of the trade jobs and they never have problems finding workers for decent unions. What they want is someone with experience that will work for an apprentice pay but work at a master's pace. Then the larger unionized companies just use the 'shortage' to hire foreign workers at a fraction of the wage exasperating the problem.", "title": ""}, "473644": {"text": "I used to use Quicken, but support for that has been suspended in the UK.  I had started using Mvelopes, but support for that was suspended as well!  What I use now is an IPhone app called IXpenseit to track my spending.", "title": ""}, "465905": {"text": "When you got your original HUD backed mortgage there were three options: monthly, annual and upfront payments. The plan is designed to insure the lender of the mortgage against your default. The plan is not expected to cover the mortgage for 30 years.  If you are in the early years of the mortgage, you may be owed a refund for the unused years. HUD has a Fact sheet discussing this, and a page to help you determine if they owe you a refund. If you are refinancing back into a HUD/FHA mortgage they will not give you a refund, but will roll the refund back into your new loan. FHA to FHA Refinances: When an FHA loan is refinanced, the refund from the old premium may be applied toward the up-front premium required for the new loan. Note: Depending on the year of the original loan the government has different lengths they used for coverage and refunds. I suggest you use the webpage to determine if you are due a refund, or a roll over.", "title": ""}, "488287": {"text": "\"To be at a dinner next to a \"\"big shot at a giant Wall Street investment bank\"\" to me makes me think they weren't at Applebee's. This guy went to Princeton. This may be a huge generalization but that sounds like a privileged life. Luck would be Eddie Murphy begging on the street when 2 old farts make him a partner in the company. That's lucky as hell. This dude is ivy league and thus run in the circles of success plus he also delivers the goods as a writer. It turns out he's successful. To me it's not really *that* lucky it's more about the cultivation of opportunities and focus.\"", "title": ""}, "57406": {"text": "I took littleadv's advice and talked to an accountant today. Regardless of method of payment, my US LLC does not have to withhold taxes or report the payment as payments to contractors (1099/1042(S)) to the IRS; it is simply a business expense.  He said this gets more complicated if the recipient is working in the US (regardless of nationality), but that is not my case", "title": ""}, "436536": {"text": "Whenever a large number of shares to be sold hit the market at the same time the expectation is that the price for each share will drop. The employees in a normal market would be expected to sell some of their shares at the first opportunity. Because during the dot com boom some companies employees were able to become millionaires, every employee at a tech IPO hopes to be richly rewarded. If the long term prospects of the stock price are viewed by the employees as a continuous path up, then the percentage of shares that will hit the market is low. They do want some instant cash, but want the bulk of the shares to capture future growth. The more dismal the long term price lookout is, the greater the percentage of shares that will hit the market. The general consensus is that as each of the Lock Ups expires a significant percentage of shares will be sold, and the price will suffer a short term drop.", "title": ""}, "569357": {"text": "I think the measurements are made at 55mph.   However, it's more complicated than that. 220 miles is an average range.  You might get 280 miles in summer, and 170 in winter.   Going 75 will take a few more miles off the range compared to 55, but not all that much difference.", "title": ""}, "200054": {"text": "When you sell the stock your income is from the difference of prices between when you bought the stock and when you sold it. There's no interest there. The interest is in two places: the underlying company assets (which you own, whether you want it or not), and in the distribution of the income to the owners (the dividends). You can calculate which portion of the interest income constitutes your dividend by allocating the portions of your dividend in the proportions of the company income. That would (very roughly and unreliably, of course) give you an estimate what portion of your dividend income derives from the interest. Underlying assets include all the profits of the company that haven't been distributed through dividends, but rather reinvested back into the business. These may or may not be reflected in the market price of the company. Bottom line is that there's no direct correlation between the income from the sale of the stake of ownership and the company income from interest, if any correlation at all exists. Why would you care about interest income of Salesforce? Its not a bank or a lender, they may have some interest income, but that's definitely not the main income source of the company. If you want to know how much interest income exactly the company had, you'll have to dig deep inside the quarterly and annual reports, and even then I'm not sure if you'll find it as a separate item for a company that's not in the lending business.", "title": ""}, "221605": {"text": "Sometimes there are credit cards that offer a (promotional) 0% APR on transfers with no transfer fees.  It can be a good option to move the money to one of these if you're disciplined enough to keep hacking away at the debt before the APR jumps.", "title": ""}}, "split": {"train": {"qrels": {"2320": {"200054": 1, "112003": 1}, "2205": {"57406": 1, "422603": 1, "264068": 1}}, "queries": {"2320": "How can I calculate interest portion of income when selling a stock?", "2205": "Tax considerations for outsourcing freelance work to foreign country"}}, "dev": {"qrels": {"6937": {"436536": 1, "73321": 1, "481339": 1, "337049": 1}, "5055": {"465905": 1}}, "queries": {"6937": "Are there common stock price trends related to employee option plans?", "5055": "Does re-financing an FHA-insured mortgage incur the UFMIP again?"}}}}